{
  "blogs": [
    {
      "title": "Windows 11: Do we need another operating system",
      "body": "\n\nCliff Saran\nManaging Editor\nPublished: 30 June 2021 14:17\n   \nAbout This Blog\nUnravelling the hype behind IT for creating useful CIO strategies.\n\nLatest Blog Posts\nMobile operating systems: It's not about VHS versus Betamax\nDo the right thing\nSee More\nRelated Content\nCan Microsoft change its spots?\n– ComputerWeekly.com\nWindows 11: It’s more than a repositioned start button\n– ComputerWeekly.com\nHow will Microsoft respond to Apple/IBM partnership?\n– ComputerWeekly.com\nBlogRoll\nCliff Saran's Enterprise blog\nComputer Weekly Editors Blog\nNetworks Generation\nInspect-a-Gadget\nWhen IT Meets Politics\nData Matters\nCW Developer Network\nOpen Source Insider\nWITsend\nAhead in the Clouds\nWrite side up - by Freeform Dynamics\nDowntime\nEyes on APAC\nQuocirca Insights\nTaking stock of retail tech\nITWorks\nFintech makes the world go around\nStorageBuzz\nThe Full Spectrum\nPublic Sector IT\nRead all about IT!\nComputer Weekly Data Bank\nIdentity, Privacy and Trust\nDavid Laceys IT Security Blog\nInvestigating Outsourcing\nManagement Matters\nGreen Tech\nThe SocialITe\nThe Social Enterprise\nSmall Matters\n+ View All Blogs\nLatest News\nPost-pandemic recovery drives NHS digitisation\nGoogle Cloud, Ericsson target telcos with 5G, edge cloud solutions\nProductivity apps here to stay as quarterly mobile app spending hits all-time high\nView All News\nDownload Computer Weekly\n\nIN THE CURRENT ISSUE:\nUK taskforce calls for cutting GDPR protections\nNHSX policy document focuses on patients and data sharing\nPrivate cloud deployments: Beating the blind spots and bottlenecks\nDownload Current Issue\nOne can see the reason why Microsoft saw a need to update Windows 10. Apple has been updating MacOS and has now moved its hardware away from the Intel x86 processor family to focus on its M1 ARM-based system on a chip. Mac users wishing to run Windows are unable to use “bootcamp”, the utility which provides Macs with a dual boot option to run Windows.\n\nCONTENT CONTINUES BELOW\nDOWNLOAD THIS FREE GUIDE\n\nIT Priority Topics 2021 Infographic\nThis year, a survey was conducted quizzing nearly 500 European IT sector professionals to gather what topics they identified as being imperative for 2021. In this infographic see whether remote working is here to stay, if there will be shifts in information management trends and what infrastructure tools will be deployed by most in 2021. Download this PDF infographic to find out what the results showed.\n\nCorporate Email Address:\n\nI agree to TechTarget’s Terms of Use, Privacy Policy, and the transfer of my information to the United States for processing to provide me with relevant information as described in our Privacy Policy.\n\nI agree to my information being processed by TechTarget and its Partners to contact me via phone, email, or other means regarding information relevant to my professional interests. I may unsubscribe at any time.\n\nMicrosoft probably felt compelled to do something, and make a big splash. After all, Windows 10 was released six years ago.\n\nBut while Apple has focused on its core hardware and software platform, Microsoft has been trying harder and harder to make Windows more open. If the open source developers conferences are anything to go by, Apple hardware is the preferred platform for software developers. MacOS and BSD Unix have a common ancestry, which may be why developers haven been drawn to it.\n\nMore openness\nIn an attempt to lure software developers away from MacOS, Microsoft has been steadily embracing more and more open source technologies. It acquired GitHub. It also offers a Unix shell for Windows 10 and the Windows Subsystem for Linux lets developers run a GNU/Linux environment – including most command-line tools, utilities, and applications – directly on Windows, unmodified, without the overhead of a traditional virtual machine or dual boot setup.\n\n\nThis philosophy for openness goes further with Windows 11. In his comments introducing the new operating system, Microsoft CEO, Satya Nadella, said: “Personal computing requires choice. We want to remove the barriers to provide real choice.” Windows 10 already supports ARM-based hardware. Windows 11, now offers users the ability to run Android apps, albeit via Amazon’s Android appstore.\n\nFor someone who has designs to build the next internet mega platform, Nadella positions Windows 11 as a platform for platform developers. The implications are that Microsoft is on a journey to become a more open company. Nadella sees Windows as a platform that does not put limits on what developers want to do.\n\nThe Microsoft Store, for instance, now allows developers to plug-in their own ecommerce platform, so they can avoid sharing revenue with Microsoft.\n\nAll of these things are great additions to Windows, but is another OS really necessary? No one really makes a big song and dance about the latest Android OS. Strictly speaking, iOS is Apple’s megaphone to shout about new iPhones and iPads. The thing is, Windows 11 could simply have been rolled into the next half yearly OS update that Microsoft issues.",
      "author": "Alex",
      "id": 2
    },
    {
      "title": "Huawei MateBook X Pro 2021",
      "body": "Quite how Huawei’s colour stylists work to come up with its product finish details is tough to guess, but case finish notwithstanding, this a high-end product so if it came in pink you could expect its product details to list salmon, coral, fuschia or some other paint-shop fanciness.\n\n\nWhen we say high-end, we mean that the Huawei MateBook X Pro 2021 with Intel 11th Gen I7 comes in at RRP: £1599.99 at the time of writing. You get 16GB RAM, 1TB of storage and if you don’t like Misty Blue (sorry, Emerald Green) then you can have Huawei’s take on Space Grey, which is in fact gray, in a kind of space age ‘hull of a spacecraft’ kind of way.\n\nWe borrowed one of these devices for a week and Huawei delivered it under Covid-19 complaint restrictions safely. Given that the latest Huawei smartwatch has a 20-second handwash feature, you would hope for nothing less.",
      "author": "Anca",
      "id": 3
    },
    {
      "title": "The dangers of binary arguments in a complex and relative digital world",
      "body": "In his 1983 book, Modern times: a history of the world from the 1920s to the year 2000, historian Paul Johnson claims the modern world started on 29 May 1919, when astronomers studying a solar eclipse were the first to test and prove Einstein’s theory of relativity. As a result, writes Johnson, “The belief began to circulate… that there were no longer any absolutes: of time and space, of good and evil, of knowledge, above all of value”.",
      "author": "Other",
      "id": 4
    }
  ]
}